
### docker
brew 'docker'

### shells
brew 'zsh-completions'

### version control systems
brew 'curl', args: ['with-openssl']
brew  'git', args: ['with-pcre', 'with-brewed-curl', 'with-brewed-openssl']
brew  'hub'

### http tools
brew  'httpie'
brew  'jq'

### gnu userland utils
tap 'homebrew/dupes'
brew  'binutils'
brew  'coreutils'
brew  'diffutils'
brew  'findutils'
brew  'gawk'
brew  'gnu-indent'
brew  'gnu-sed'
brew  'gnu-tar'
brew  'gnutls'
brew  'grep' # gnu grep is in homebrew/dupes
brew  'gzip'
brew  'less'
brew  'htop'
brew  'fzf'

### finders
brew 'ag'
brew 'fd'
brew 'ack'

### dbs
brew  'mysql@5.7', restart_service: :changed
brew  'postgresql@9.6', restart_service: :changed
brew  'memcached', restart_service: :changed
brew  'redis', restart_service: :changed
